In [2]:
import os
import pandas as pd
print(os.getcwd())

C:\Users\MSA\Python-repository

In [4]:
os.chdir('C:\\Users\\MSA\\Python-repository')

In [5]:
print(os.getcwd())

C:\Users\MSA

In [6]:
os.chdir('C:\\Users\\MSA\\Python-repository')

In [4]:
print(os.getcwd())

C:\Users\MSA\Python-repository

In [3]:
CSV = pd.read_csv('InterestingCSV.txt')
print(CSV)

       Batsman  Total
0   DeVilliers   1011
1    John Snow    100
2          CDS    123
3         VDSA   4324
4         VDFG    653
5          VER    764
6          FGG     76
7         DGGJ    123
8          DGJ    653
9         DKJH    764
10         DLK     12
11         EQW    431
12         EZD    431

In [29]:
CSV

       Batsman  Total
0   DeVilliers   1011
1    John Snow    100
2          CDS    123
3         VDSA   4324
4         VDFG    653
5          VER    764
6          FGG     76
7         DGGJ    123
8          DGJ    653
9         DKJH    764
10         DLK     12
11         EQW    431
12         EZD    431

In [30]:
len(CSV) #check number of rows

13

In [41]:
CSV.columns #check all the columns

Index(['Batsman', 'Total'], dtype='object')

In [24]:
len(CSV.columns)  #check number of columns

2

In [32]:
CSV.head(3)  #top list from the table

      Batsman  Total
0  DeVilliers   1011
1   John Snow    100
2         CDS    123

In [36]:
CSV.tail(2)  #bottom list from the table

   Batsman  Total
11     EQW    431
12     EZD    431

In [38]:
CSV.info()  #information for columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 2 columns):
Batsman    13 non-null object
Total      13 non-null int64
dtypes: int64(1), object(1)
memory usage: 288.0+ bytes

In [39]:
CSV.describe()  #get statistical data on columns

             Total
count    13.000000
mean    728.076923
std    1127.894754
min      12.000000
25%     123.000000
50%     431.000000
75%     764.000000
max    4324.000000

In [40]:
CSV.describe().transpose()  #format with headings

       count        mean          std   min    25%    50%    75%     max
Total   13.0  728.076923  1127.894754  12.0  123.0  431.0  764.0  4324.0

In [47]:
CSV.columns = ['Batsman', 'Total Runs']  #renaming columns, columns will be renamed by the value you put here
CSV.head(3)

      Batsman  Total Runs
0  DeVilliers        1011
1   John Snow         100
2         CDS         123

In [48]:
CSV[10:12]

   Batsman  Total Runs
10     DLK          12
11     EQW         431

In [52]:
CSV[:3]  #similar as CSV[0:3]

      Batsman  Total Runs
0  DeVilliers        1011
1   John Snow         100
2         CDS         123

In [53]:
CSV[:-3]

      Batsman  Total Runs
0  DeVilliers        1011
1   John Snow         100
2         CDS         123
3        VDSA        4324
4        VDFG         653
5         VER         764
6         FGG          76
7        DGGJ         123
8         DGJ         653
9        DKJH         764

In [61]:
CSV[::-1]  
#this wil revert the indexing, 
#alternate: CSV.reindex(index=CSV.index[::-1])
#alternative: CSV.iloc[::-1]

       Batsman  Total Runs
12         EZD         431
11         EQW         431
10         DLK          12
9         DKJH         764
8          DGJ         653
7         DGGJ         123
6          FGG          76
5          VER         764
4         VDFG         653
3         VDSA        4324
2          CDS         123
1    John Snow         100
0   DeVilliers        1011

In [75]:
CSV[::3]  #fetch every 3rd row

       Batsman  Total Runs
0   DeVilliers        1011
3         VDSA        4324
6          FGG          76
9         DKJH         764
12         EZD         431

In [6]:
CSV['Batsman']  #only get mentioned column

0     DeVilliers
1      John Snow
2            CDS
3           VDSA
4           VDFG
5            VER
6            FGG
7           DGGJ
8            DGJ
9           DKJH
10           DLK
11           EQW
12           EZD
Name: Batsman, dtype: object

In [82]:
CSV.Batsman  #only get mentioned column

0     DeVilliers
1      John Snow
2            CDS
3           VDSA
4           VDFG
5            VER
6            FGG
7           DGGJ
8            DGJ
9           DKJH
10           DLK
11           EQW
12           EZD
Name: Batsman, dtype: object

In [81]:
CSV[0:4]['Batsman']  #slice and get only the mentioned column

0    DeVilliers
1     John Snow
2           CDS
3          VDSA
Name: Batsman, dtype: object

In [85]:
CSV['NewColumn'] = CSV['Total Runs']*1.01
CSV

In [88]:
CSV['NewColumn2'] = CSV['1,2,3,4']   #Will throw an error !!
CSV

KeyError: '1,2,3,4'

In [95]:
CSV.drop('NewColumn',axis=1).head(2)   #drops the column from the view, if you run CSV you will see all the columns

      Batsman  Total Runs
0  DeVilliers        1011
1   John Snow         100

In [96]:
CSV.head(2)

      Batsman  Total Runs  NewColumn
0  DeVilliers        1011    1021.11
1   John Snow         100     101.00

In [93]:
CSV = CSV.drop('NewColumn',axis=1)   #drops the column from the imported data

       Batsman  Total Runs  NewColumn
0   DeVilliers        1011    1021.11
1    John Snow         100     101.00
2          CDS         123     124.23
3         VDSA        4324    4367.24
4         VDFG         653     659.53
5          VER         764     771.64
6          FGG          76      76.76
7         DGGJ         123     124.23
8          DGJ         653     659.53
9         DKJH         764     771.64
10         DLK          12      12.12
11         EQW         431     435.31
12         EZD         431     435.31

In [101]:
CSV.columns = ['Batsman', 'TotalRuns' , 'NewColumn']  #renaming columns, columns will be renamed by the value you put here
CSV.head(3)

      Batsman  TotalRuns  NewColumn
0  DeVilliers       1011    1021.11
1   John Snow        100     101.00
2         CDS        123     124.23

In [104]:
Filter1 = CSV.TotalRuns > 1000
Filter1

0      True
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
Name: TotalRuns, dtype: bool

In [108]:
CSV[Filter1]

      Batsman  TotalRuns  NewColumn
0  DeVilliers       1011    1021.11
3        VDSA       4324    4367.24

In [126]:
CSV[CSV.TotalRuns > 100][CSV.TotalRuns < 2000]  #did not find anywhere but seems like it works
#it will work for AND operatior but when you use the OR operator it will not work ... why ? (below)
#[CSV.TotalRuns > 100] creates a dataset, then use the OPERATOR to connect to [CSV.TotalRuns < 2000]

C:\Users\MSA\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

       Batsman  TotalRuns  NewColumn
0   DeVilliers       1011    1021.11
2          CDS        123     124.23
4         VDFG        653     659.53
5          VER        764     771.64
7         DGGJ        123     124.23
8          DGJ        653     659.53
9         DKJH        764     771.64
11         EQW        431     435.31
12         EZD        431     435.31

In [119]:
CSV[(CSV.TotalRuns > 1000) & (CSV.NewColumn < 4000)]   #the official way to do it

      Batsman  TotalRuns  NewColumn
0  DeVilliers       1011    1021.11

In [6]:
CSV[CSV.Batsman == "CDS"]

  Batsman  Total
2     CDS    123

In [13]:
CSV.head(4)

      Batsman  Total
0  DeVilliers   1011
1   John Snow    100
2         CDS    123
3        VDSA   4324

In [16]:
#CSV[3,1] -> does not work in case of data frames, have to use .at or .iat
CSV.iat[3,1]  #.iat: 3 = index no, 1=index no

4324

In [19]:
CSV.at[3,'Total']   #.at: 3 = label no. not index no. not row no. , Total = column name

4324